In [1]:
import pandas as pd
import cv2
import pandasql

In [2]:
imp_img = '/Users/diegovillalizarraga/Maestria Ciencia de Datos ITAM/2do Semestre/Deep Learning/Proyecto Final/datos/Flicker8k_Dataset'
out_img = '/Users/diegovillalizarraga/Maestria Ciencia de Datos ITAM/2do Semestre/Deep Learning/Proyecto Final/text-to-image/102flowers'
out_txt = '/Users/diegovillalizarraga/Maestria Ciencia de Datos ITAM/2do Semestre/Deep Learning/Proyecto Final/text-to-image/text_c10'

In [3]:
file = '/Users/diegovillalizarraga/Maestria Ciencia de Datos ITAM/2do Semestre/Deep Learning/Proyecto Final/datos/Flickr8k_text/Flickr8k.token.txt'
df_token = pd.read_csv(file, sep='\t', header=None)
df_token.columns = ['image', 'description']

In [4]:
df_token.head()

,image,description
0,2258277193_586949ec62 1000268201_693b08cb0e.jpg#0,A child in a pink dress is climbing up a set o...
1,1000268201_693b08cb0e.jpg#1,A girl going into a wooden building .
2,1000268201_693b08cb0e.jpg#2,A little girl climbing into a wooden playhouse .
3,1000268201_693b08cb0e.jpg#3,A little girl climbing the stairs to her playh...
4,1000268201_693b08cb0e.jpg#4,A little girl in a pink dress going into a woo...

In [5]:
df_token[['image', 'number']]= df_token.image.str.split("#",expand=True)

In [6]:
df_token = df_token.drop(['number'], axis=1)
df_token.head()

,image,description
0,2258277193_586949ec62 1000268201_693b08cb0e.jpg,A child in a pink dress is climbing up a set o...
1,1000268201_693b08cb0e.jpg,A girl going into a wooden building .
2,1000268201_693b08cb0e.jpg,A little girl climbing into a wooden playhouse .
3,1000268201_693b08cb0e.jpg,A little girl climbing the stairs to her playh...
4,1000268201_693b08cb0e.jpg,A little girl in a pink dress going into a woo...

In [7]:
df_token.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40455 entries, 0 to 40454
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   image        40455 non-null  object
 1   description  40455 non-null  object
dtypes: object(2)
memory usage: 632.2+ KB

In [8]:
sql = "SELECT image, count(description) \
                FROM df_token \
                GROUP BY image \
                ORDER BY image"
conteo_desc = pandasql.sqldf(sql, globals())
conteo_desc.head()

                       image  count(description)
0  1000268201_693b08cb0e.jpg                   4
1  1001773457_577c3a7d70.jpg                   5
2  1002674143_1b742ab4b8.jpg                   5
3  1003163366_44323f5815.jpg                   5
4  1007129816_e794419615.jpg                   5

In [9]:
sql = "SELECT * \
            FROM df_token \
            WHERE image != '1000268201_693b08cb0e.jpg'"
df_token = pandasql.sqldf(sql, globals())
df_token.head()

,image,description
0,2258277193_586949ec62 1000268201_693b08cb0e.jpg,A child in a pink dress is climbing up a set o...
1,1001773457_577c3a7d70.jpg,A black dog and a spotted dog are fighting
2,1001773457_577c3a7d70.jpg,A black dog and a tri-colored dog playing with...
3,1001773457_577c3a7d70.jpg,A black dog and a white dog with brown spots a...
4,1001773457_577c3a7d70.jpg,Two dogs of different breeds looking at each o...

In [10]:
sql = "SELECT DISTINCT image \
                FROM df_token \
                ORDER BY image"
df_token_unique = pandasql.sqldf(sql, globals())
df_token_unique.head()

                       image
0  1001773457_577c3a7d70.jpg
1  1002674143_1b742ab4b8.jpg
2  1003163366_44323f5815.jpg
3  1007129816_e794419615.jpg
4  1007320043_627395c3d8.jpg

In [11]:
df_token_unique.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8091 entries, 0 to 8090
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   8091 non-null   object
dtypes: object(1)
memory usage: 63.3+ KB

Filtramos los sujetos

Vaemos man

In [12]:
man = df_token.query('description.str.contains("man")')

In [13]:
man.head()

,image,description
11,1003163366_44323f5815.jpg,A man lays on a bench while his dog sits by him .
12,1003163366_44323f5815.jpg,A man lays on the bench to which a white dog i...
13,1003163366_44323f5815.jpg,a man sleeping on a bench outside with a white...
14,1003163366_44323f5815.jpg,A shirtless man lies on a park bench with his ...
15,1003163366_44323f5815.jpg,man laying on bench holding leash of dog sitti...

In [14]:
man.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9489 entries, 11 to 40447
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   image        9489 non-null   object
 1   description  9489 non-null   object
dtypes: object(2)
memory usage: 222.4+ KB

In [15]:
sql = "SELECT DISTINCT image \
                FROM man \
                ORDER BY image"
man_unique = pandasql.sqldf(sql, globals())
man_unique.head()

                       image
0  1003163366_44323f5815.jpg
1  1007129816_e794419615.jpg
2  1015118661_980735411b.jpg
3   101669240_b2d3e7f17b.jpg
4  1016887272_03199f49c4.jpg

In [16]:
man_unique.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3422 entries, 0 to 3421
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   3422 non-null   object
dtypes: object(1)
memory usage: 26.9+ KB

Veamos woman

In [17]:
woman = df_token.query('description.str.contains("woman")')

In [18]:
woman.head()

,image,description
76,1022454332_6af2c1449a.jpg,A child and a woman are at waters edge in a bi...
84,1022454428_b6b660a67b.jpg,A man and woman care for an infant along the s...
136,1032122270_ea6f0beedb.jpg,A woman crouches near three dogs in a field .
161,1042590306_95dea0916c.jpg,A man and woman pose for the camera while anot...
162,1042590306_95dea0916c.jpg,A man is holding the hand of a woman up to his...

In [19]:
sql = "SELECT DISTINCT image \
                FROM woman \
                ORDER BY image"
woman_unique = pandasql.sqldf(sql, globals())
woman_unique.head()

                       image
0  1022454332_6af2c1449a.jpg
1  1022454428_b6b660a67b.jpg
2  1032122270_ea6f0beedb.jpg
3  1042590306_95dea0916c.jpg
4   105342180_4d4a40b47f.jpg

In [20]:
woman_unique.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1237 entries, 0 to 1236
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   1237 non-null   object
dtypes: object(1)
memory usage: 9.8+ KB

Veamos dog

In [21]:
dog = df_token.query('description.str.contains("dog")')

In [22]:
dog.head()

,image,description
1,1001773457_577c3a7d70.jpg,A black dog and a spotted dog are fighting
2,1001773457_577c3a7d70.jpg,A black dog and a tri-colored dog playing with...
3,1001773457_577c3a7d70.jpg,A black dog and a white dog with brown spots a...
4,1001773457_577c3a7d70.jpg,Two dogs of different breeds looking at each o...
5,1001773457_577c3a7d70.jpg,Two dogs on pavement moving toward each other .

In [23]:
sql = "SELECT DISTINCT image \
                FROM dog \
                ORDER BY image"
dog_unique = pandasql.sqldf(sql, globals())
dog_unique.head()

                       image
0  1001773457_577c3a7d70.jpg
1  1003163366_44323f5815.jpg
2  1009434119_febe49276a.jpg
3  1012212859_01547e3f17.jpg
4  1015584366_dfcec3c85a.jpg

In [24]:
dog_unique.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2023 entries, 0 to 2022
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   2023 non-null   object
dtypes: object(1)
memory usage: 15.9+ KB

Veamos boy

In [25]:
boy = df_token.query('description.str.contains("boy")')

In [26]:
boy.head()

,image,description
36,1015118661_980735411b.jpg,A boy smiles in front of a stony wall in a city .
37,1015118661_980735411b.jpg,A little boy is standing on the street while a...
38,1015118661_980735411b.jpg,A young boy runs aross the street .
40,1015118661_980735411b.jpg,Smiling boy in white shirt and blue jeans in f...
78,1022454332_6af2c1449a.jpg,A little boy at a lake watching a duck .

In [27]:
sql = "SELECT DISTINCT image \
                FROM boy \
                ORDER BY image"
boy_unique = pandasql.sqldf(sql, globals())
boy_unique.head()

                       image
0  1015118661_980735411b.jpg
1  1022454332_6af2c1449a.jpg
2  1028205764_7e8df9a2ea.jpg
3   103106960_e8a41d64f8.jpg
4  1034276567_49bb87c51c.jpg

In [28]:
boy_unique.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1486 entries, 0 to 1485
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   1486 non-null   object
dtypes: object(1)
memory usage: 11.7+ KB

Veamos girl

In [29]:
girl = df_token.query('description.str.contains("girl")')

In [30]:
girl.head()

,image,description
6,1002674143_1b742ab4b8.jpg,A little girl covered in paint sits in front o...
7,1002674143_1b742ab4b8.jpg,A little girl is sitting in front of a large p...
8,1002674143_1b742ab4b8.jpg,A small girl in the grass plays with fingerpai...
9,1002674143_1b742ab4b8.jpg,There is a girl with pigtails sitting in front...
10,1002674143_1b742ab4b8.jpg,Young girl with pigtails painting outside in t...

In [31]:
sql = "SELECT DISTINCT image \
                FROM girl \
                ORDER BY image"
girl_unique = pandasql.sqldf(sql, globals())
girl_unique.head()

                       image
0  1002674143_1b742ab4b8.jpg
1  1007320043_627395c3d8.jpg
2  1042590306_95dea0916c.jpg
3  1045521051_108ebc19be.jpg
4   105342180_4d4a40b47f.jpg

In [32]:
girl_unique.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1394 entries, 0 to 1393
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   1394 non-null   object
dtypes: object(1)
memory usage: 11.0+ KB

Veamos water, pool, swimming

In [33]:
water = df_token.query('description.str.contains("water")')
pool = df_token.query('description.str.contains("pool")')
swimming = df_token.query('description.str.contains("swimming")')

In [34]:
sql = "SELECT DISTINCT image \
                FROM water \
                ORDER BY image"
water_unique = pandasql.sqldf(sql, globals())
water_unique.head()

                       image
0  1012212859_01547e3f17.jpg
1  1019077836_6fc9b15408.jpg
2  1022454332_6af2c1449a.jpg
3  1022454428_b6b660a67b.jpg
4  1022975728_75515238d8.jpg

In [35]:
sql = "SELECT DISTINCT image \
                FROM pool \
                ORDER BY image"
pool_unique = pandasql.sqldf(sql, globals())
pool_unique.head()

                       image
0  1057089366_ca83da0877.jpg
1  1077546505_a4f6c4daa9.jpg
2  1077931201_1e0bb83105.jpg
3  1087168168_70280d024a.jpg
4  1096097967_ac305887b4.jpg

In [36]:
sql = "SELECT DISTINCT image \
                FROM swimming \
                ORDER BY image"
swimming_unique = pandasql.sqldf(sql, globals())
swimming_unique.head()

                       image
0  1022454332_6af2c1449a.jpg
1  1057089366_ca83da0877.jpg
2   106490881_5a2dd9b7bd.jpg
3  1077546505_a4f6c4daa9.jpg
4  1096165011_cc5eb16aa6.jpg

In [37]:
sql = "SELECT DISTINCT image \
                FROM water_unique \
            UNION ALL \
        SELECT image \
                FROM pool_unique \
            UNION ALL \
        SELECT image \
                FROM swimming_unique"
agua = pandasql.sqldf(sql, globals())
agua.head()

                       image
0  1012212859_01547e3f17.jpg
1  1019077836_6fc9b15408.jpg
2  1022454332_6af2c1449a.jpg
3  1022454428_b6b660a67b.jpg
4  1022975728_75515238d8.jpg

In [38]:
agua.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1583 entries, 0 to 1582
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   1583 non-null   object
dtypes: object(1)
memory usage: 12.5+ KB

In [39]:
sql = "SELECT DISTINCT image \
                FROM agua"
agua_unique = pandasql.sqldf(sql, globals())
agua_unique.head()

                       image
0  1012212859_01547e3f17.jpg
1  1019077836_6fc9b15408.jpg
2  1022454332_6af2c1449a.jpg
3  1022454428_b6b660a67b.jpg
4  1022975728_75515238d8.jpg

In [40]:
agua_unique.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1239 entries, 0 to 1238
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   1239 non-null   object
dtypes: object(1)
memory usage: 9.8+ KB

Veamos bike, riding, bicycle, motorcycle, biker, motorcyclist

In [41]:
bike = df_token.query('description.str.contains("bike")')
riding = df_token.query('description.str.contains("riding")')
bicycle = df_token.query('description.str.contains("bicycle")')
motorcycle = df_token.query('description.str.contains("motorcycle")')
biker = df_token.query('description.str.contains("biker")')
motorcyclist = df_token.query('description.str.contains("motorcyclist")')

In [42]:
sql = "SELECT DISTINCT image \
                FROM bike \
                ORDER BY image"
bike_unique = pandasql.sqldf(sql, globals())
bike_unique.head()

                       image
0  1075716537_62105738b4.jpg
1   110595925_f3395c8bd6.jpg
2   112243673_fd68255217.jpg
3  1142847777_2a0c1c2551.jpg
4  1143373711_2e90b7b799.jpg

In [43]:
sql = "SELECT DISTINCT image \
                FROM riding \
                ORDER BY image"
riding_unique = pandasql.sqldf(sql, globals())
riding_unique.head()

                       image
0  1087539207_9f77ab3aaf.jpg
1   109738916_236dc456ac.jpg
2   109823395_6fb423a90f.jpg
3   109823397_e35154645f.jpg
4   110595925_f3395c8bd6.jpg

In [44]:
sql = "SELECT DISTINCT image \
                FROM bicycle \
                ORDER BY image"
bicycle_unique = pandasql.sqldf(sql, globals())
bicycle_unique.head()

                       image
0  1075716537_62105738b4.jpg
1   110595925_f3395c8bd6.jpg
2  1124448967_2221af8dc5.jpg
3  1142847777_2a0c1c2551.jpg
4  1143373711_2e90b7b799.jpg

In [45]:
sql = "SELECT DISTINCT image \
                FROM motorcycle \
                ORDER BY image"
motorcycle_unique = pandasql.sqldf(sql, globals())
motorcycle_unique.head()

                       image
0   112243673_fd68255217.jpg
1  1251558317_4ef844b775.jpg
2  1252396628_eb81d3905b.jpg
3   143552697_af27e9acf5.jpg
4   143552829_72b6ba49d4.jpg

In [46]:
sql = "SELECT DISTINCT image \
                FROM biker \
                ORDER BY image"
biker_unique = pandasql.sqldf(sql, globals())
biker_unique.head()

                       image
0   110595925_f3395c8bd6.jpg
1  1143373711_2e90b7b799.jpg
2  1148238960_f8cacec2fc.jpg
3   124881487_36e668145d.jpg
4  1252396628_eb81d3905b.jpg

In [47]:
sql = "SELECT DISTINCT image \
                FROM motorcyclist \
                ORDER BY image"
motorcyclist_unique = pandasql.sqldf(sql, globals())
motorcyclist_unique.head()

                       image
0   166321294_4a5e68535f.jpg
1   166433861_70b66cd381.jpg
2   216172386_9ac5356dae.jpg
3  2471974379_a4a4d2b389.jpg
4  2489602993_896c1ea40a.jpg

In [48]:
sql = "SELECT DISTINCT image \
                FROM bike_unique \
            UNION ALL \
        SELECT image \
                FROM riding_unique \
            UNION ALL \
        SELECT image \
                FROM bicycle_unique \
            UNION ALL \
        SELECT image \
                FROM motorcycle_unique \
            UNION ALL \
        SELECT image \
                FROM biker_unique \
            UNION ALL \
        SELECT image \
                FROM motorcyclist_unique"
riders = pandasql.sqldf(sql, globals())
riders.head()

                       image
0  1075716537_62105738b4.jpg
1   110595925_f3395c8bd6.jpg
2   112243673_fd68255217.jpg
3  1142847777_2a0c1c2551.jpg
4  1143373711_2e90b7b799.jpg

In [49]:
riders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1519 entries, 0 to 1518
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   1519 non-null   object
dtypes: object(1)
memory usage: 12.0+ KB

In [50]:
sql = "SELECT DISTINCT image \
                FROM riders"
riders_unique = pandasql.sqldf(sql, globals())
riders_unique.head()

                       image
0  1075716537_62105738b4.jpg
1   110595925_f3395c8bd6.jpg
2   112243673_fd68255217.jpg
3  1142847777_2a0c1c2551.jpg
4  1143373711_2e90b7b799.jpg

In [51]:
riders_unique.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 769 entries, 0 to 768
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   769 non-null    object
dtypes: object(1)
memory usage: 6.1+ KB

Veamos surf, surfer, snowboarder, skateboarder, skateboard

In [52]:
surf = df_token.query('description.str.contains("surf")')
surfer = df_token.query('description.str.contains("surfer")')
snowboarder = df_token.query('description.str.contains("snowboarder")')
skateboarder = df_token.query('description.str.contains("skateboarder")')
skateboard = df_token.query('description.str.contains("skateboard")')

In [53]:
sql = "SELECT DISTINCT image \
                FROM surf \
                ORDER BY image"
surf_unique = pandasql.sqldf(sql, globals())
surf_unique.head()

                       image
0   101654506_8eb26cfb60.jpg
1  1022975728_75515238d8.jpg
2   103205630_682ca7285b.jpg
3  1053804096_ad278b25f1.jpg
4   109260218_fca831f933.jpg

In [54]:
sql = "SELECT DISTINCT image \
                FROM surfer \
                ORDER BY image"
surfer_unique = pandasql.sqldf(sql, globals())
surfer_unique.head()

                       image
0   172097783_292c5413d8.jpg
1  1998457059_c9ac9a1e1a.jpg
2  2201951969_0d7520d648.jpg
3   222369445_5b6af347dd.jpg
4  2238019823_79318d1f11.jpg

In [55]:
sql = "SELECT DISTINCT image \
                FROM snowboarder \
                ORDER BY image"
snowboarder_unique = pandasql.sqldf(sql, globals())
snowboarder_unique.head()

                       image
0   113678030_87a6a6e42e.jpg
1  1383698008_8ac53ed7ec.jpg
2   182493240_40410254b0.jpg
3  2065309381_705b774f51.jpg
4  2073105823_6dacade004.jpg

In [56]:
sql = "SELECT DISTINCT image \
                FROM skateboarder \
                ORDER BY image"
skateboarder_unique = pandasql.sqldf(sql, globals())
skateboarder_unique.head()

                       image
0  1052358063_eae6744153.jpg
1   142802798_962a4ec5ce.jpg
2  1479028910_3dab3448c8.jpg
3  2306674172_dc07c7f847.jpg
4  2332540384_4cf26406a9.jpg

In [57]:
sql = "SELECT DISTINCT image \
                FROM skateboard \
                ORDER BY image"
skateboard_unique = pandasql.sqldf(sql, globals())
skateboard_unique.head()

                       image
0  1052358063_eae6744153.jpg
1   142802798_962a4ec5ce.jpg
2  1479028910_3dab3448c8.jpg
3   180506881_de0f59770f.jpg
4  2073105823_6dacade004.jpg

In [58]:
sql = "SELECT DISTINCT image \
                FROM surf_unique \
            UNION ALL \
        SELECT DISTINCT image \
                FROM surfer_unique \
            UNION ALL \
        SELECT DISTINCT image \
                FROM snowboarder_unique \
            UNION ALL \
        SELECT DISTINCT image \
                FROM skateboarder_unique \
            UNION ALL \
        SELECT DISTINCT image \
                FROM skateboard_unique"
boards = pandasql.sqldf(sql, globals())
boards.head()

                       image
0   101654506_8eb26cfb60.jpg
1  1022975728_75515238d8.jpg
2   103205630_682ca7285b.jpg
3  1053804096_ad278b25f1.jpg
4   109260218_fca831f933.jpg

In [59]:
boards.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 797 entries, 0 to 796
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   797 non-null    object
dtypes: object(1)
memory usage: 6.4+ KB

In [60]:
sql = "SELECT DISTINCT image \
                FROM boards"
boards_unique = pandasql.sqldf(sql, globals())
boards_unique.head()

                       image
0   101654506_8eb26cfb60.jpg
1  1022975728_75515238d8.jpg
2   103205630_682ca7285b.jpg
3  1053804096_ad278b25f1.jpg
4   109260218_fca831f933.jpg

In [61]:
boards_unique.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 535 entries, 0 to 534
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   535 non-null    object
dtypes: object(1)
memory usage: 4.3+ KB

Man y dog dejar a la mitad.

In [62]:
int(len(man_unique)/2)

1711

In [63]:
sql = "SELECT DISTINCT image \
                FROM man_unique \
                LIMIT 1711"
man_unique_mitad = pandasql.sqldf(sql, globals())
man_unique_mitad.head()

                       image
0  1003163366_44323f5815.jpg
1  1007129816_e794419615.jpg
2  1015118661_980735411b.jpg
3   101669240_b2d3e7f17b.jpg
4  1016887272_03199f49c4.jpg

In [64]:
man_unique_mitad.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1711 entries, 0 to 1710
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   1711 non-null   object
dtypes: object(1)
memory usage: 13.5+ KB

In [65]:
int(len(dog_unique)/2)

1011

In [66]:
sql = "SELECT DISTINCT image \
                FROM dog_unique \
                LIMIT 1011"
dog_unique_mitad = pandasql.sqldf(sql, globals())
dog_unique_mitad.head()

                       image
0  1001773457_577c3a7d70.jpg
1  1003163366_44323f5815.jpg
2  1009434119_febe49276a.jpg
3  1012212859_01547e3f17.jpg
4  1015584366_dfcec3c85a.jpg

In [67]:
dog_unique_mitad.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1011 entries, 0 to 1010
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   1011 non-null   object
dtypes: object(1)
memory usage: 8.0+ KB

Consolidamos todos los sujetos.

In [68]:
sql = "SELECT DISTINCT image \
                FROM man_unique_mitad \
            UNION ALL \
        SELECT DISTINCT image \
                FROM dog_unique_mitad \
            UNION ALL \
        SELECT DISTINCT image \
                FROM woman_unique \
            UNION ALL \
        SELECT DISTINCT image \
                FROM boy_unique \
            UNION ALL \
        SELECT DISTINCT image \
                FROM girl_unique \
            UNION ALL \
        SELECT DISTINCT image \
                FROM agua_unique"
sujetos = pandasql.sqldf(sql, globals())
sujetos.head()

                       image
0  1003163366_44323f5815.jpg
1  1007129816_e794419615.jpg
2  1015118661_980735411b.jpg
3   101669240_b2d3e7f17b.jpg
4  1016887272_03199f49c4.jpg

In [69]:
sujetos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8078 entries, 0 to 8077
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   8078 non-null   object
dtypes: object(1)
memory usage: 63.2+ KB

In [70]:
sql = "SELECT DISTINCT image \
                FROM sujetos"
sujetos_unique = pandasql.sqldf(sql, globals())
sujetos_unique.head()

                       image
0  1003163366_44323f5815.jpg
1  1007129816_e794419615.jpg
2  1015118661_980735411b.jpg
3   101669240_b2d3e7f17b.jpg
4  1016887272_03199f49c4.jpg

In [71]:
sujetos_unique.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5563 entries, 0 to 5562
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   image   5563 non-null   object
dtypes: object(1)
memory usage: 43.6+ KB

In [72]:
sujetos_unique['ranking'] = sujetos_unique['image'].rank(ascending=True)

In [73]:
sujetos_unique.head()

                       image  ranking
0  1003163366_44323f5815.jpg      3.0
1  1007129816_e794419615.jpg      4.0
2  1015118661_980735411b.jpg      8.0
3   101669240_b2d3e7f17b.jpg     11.0
4  1016887272_03199f49c4.jpg     12.0

In [74]:
sujetos_unique.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5563 entries, 0 to 5562
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   image    5563 non-null   object
 1   ranking  5563 non-null   float64
dtypes: float64(1), object(1)
memory usage: 87.0+ KB

Generamos los txt

In [77]:
for i in range(len(sujetos_unique['image'])):
    img = sujetos_unique.iloc[i][0]
    rank = int(sujetos_unique.iloc[i][1])
    filtro = df_token['image'] == img
    desc_txt = df_token[filtro]
    desc_txt = desc_txt.drop(['image'], axis=1)
    desc_txt.to_csv(f'{out_txt}/image_{rank}.txt', index=False, header=False)

Generamos las imagenes con el nuevo nombre.

In [78]:
for i in range(len(sujetos_unique['image'])):
    img = sujetos_unique.iloc[i][0]
    rank = int(sujetos_unique.iloc[i][1])
    file = cv2.imread(f'{imp_img}/{img}')
    cv2.imwrite(f'{out_img}/image_{rank}.jpg', file)